Revit 2027 API
FamilySymbol.CanHaveStructuralSection Method
 Identifies if this FamilySymbol can have a structural section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveStructuralSection()
Public Function CanHaveStructuralSection As Boolean
public:
bool CanHaveStructuralSection()
member CanHaveStructuralSection : unit -> bool
Return Value
Boolean
 True if the FamilySymbol can have structural section, false otherwise.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace